Revit 2027 API
BuiltInFailures.InaccurateFailures.InaccurateSketchLine Property
 Line in Sketch is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InaccurateSketchLine { get; }
Public Shared ReadOnly Property InaccurateSketchLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InaccurateSketchLine {
	FailureDefinitionId^ get ();
}
static member InaccurateSketchLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace